{"config": [{"config": {"activity_regularizer": null, "name": "Conv-1", "dilation_rate": [1, 1], "kernel_regularizer": null, "batch_input_shape": [null, 1, 100, 2200], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 8, "data_format": "channels_first", "kernel_constraint": null, "kernel_size": [10, 10], "trainable": true, "padding": "valid", "strides": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "Pool-1", "trainable": true, "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "name": "Conv-2", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 16, "data_format": "channels_first", "kernel_constraint": null, "kernel_size": [10, 10], "trainable": true, "padding": "valid", "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "Pool-2", "trainable": true, "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "Flat", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "name": "Dense-1", "units": 64, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "batch_normalization_1", "scale": true, "center": true, "momentum": 0.99, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "name": "Dense-2", "units": 16, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "Dense-3", "units": 8, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "Out", "units": 4, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}], "backend": "theano", "keras_version": "2.1.3", "class_name": "Sequential"}